BlueSCSI/BlueSCSI-v2/lib/ZuluSCSI_platform_GD32F450/ZuluSCSI_platform.cpp
    return true;
}

// the size of the main code without the bootloader
static uint32_t firmware_size(FsFile &file)
{
    uint32_t fwsize = file.size();
    if (fwsize <=  PLATFORM_BOOTLOADER_SIZE )
    {
        logmsg("Firmware file size too small: ", fwsize, " bootloader fits in the first : ", PLATFORM_BOOTLOADER_SIZE, " bytes");
        return false;
    }
    return fwsize - PLATFORM_BOOTLOADER_SIZE;
}

bool platform_firmware_erase(FsFile &file)
{
    uint32_t bootloader_sector_index = 0;
    uint32_t bootloader_sector_byte_count = 0;
    const uint32_t map_length = sizeof(platform_flash_sector_map)/sizeof(platform_flash_sector_map[0]);
    // Find at which sector the bootloader ends so it isn't overwritten
    for(;;)
    {
        if (bootloader_sector_index < map_length)
        {
            bootloader_sector_byte_count += platform_flash_sector_map[bootloader_sector_index];
            if (bootloader_sector_byte_count < PLATFORM_BOOTLOADER_SIZE)
            {
                bootloader_sector_index++;
            }
            else
            {
                break;
            }    
        }
        else
        {
            logmsg("Bootloader does not fit in flash");
            return false;
        }
                
    }
    
    // find the last sector the mainline firmware ends
    uint32_t fwsize = firmware_size(file);
    uint32_t firmware_sector_start = bootloader_sector_index + 1;
    uint32_t last_sector_index = firmware_sector_start;
    uint32_t last_sector_byte_count = 0;
    for(;;)
    {
        if (last_sector_index < map_length)
        {
            last_sector_byte_count += platform_flash_sector_map[last_sector_index];
            if (fwsize > last_sector_byte_count)
            {
                last_sector_index++;
            }
            else
            {
                break;
            }
        }
        else
        {
            logmsg("Firmware too large: ", (int) fwsize, 
                    " space left after the bootloader ",  last_sector_byte_count,
                    " total flash size ", (int)PLATFORM_FLASH_TOTAL_SIZE);
            return false;
        }
    }

    // Erase the sectors the mainline firmware will be written to
    for (int i = firmware_sector_start; i <= last_sector_index; i++)
    {
        if (i % 2 == 0)
        {
            LED_ON();
        }
        else
        {
            LED_OFF();
        }

        if (!erase_flash_sector(i))
        {
            logmsg("Flash failed to erase sector ", i);
            return false;
        }
        
    }
    LED_OFF();
    return true;
}

bool platform_firmware_program(FsFile &file)
{
    // write the mainline firmware to flash
    int32_t bytes_read = 0;
    uint32_t address_offset = PLATFORM_BOOTLOADER_SIZE;
    
    // Make sure the buffer is aligned to word boundary
    static uint32_t buffer32[PLATFORM_FLASH_WRITE_BUFFER_SIZE / 4];
    uint8_t *buffer = (uint8_t*)buffer32;

    if (!file.seek(PLATFORM_BOOTLOADER_SIZE))
    {
        logmsg("Seek failed");
        return false;
    }

    dbgmsg("Writing flash at firmware offset ", address_offset, " data ", bytearray(buffer, 4));

    for(;;)
    {
        if ((address_offset - PLATFORM_BOOTLOADER_SIZE) / PLATFORM_FLASH_WRITE_BUFFER_SIZE % 2)
        {
            LED_ON();
        }
        else
        {
            LED_OFF();
        }
        
        bytes_read = file.read(buffer, PLATFORM_FLASH_WRITE_BUFFER_SIZE);
        if ( bytes_read < 0)
        {
            logmsg("Firmware file read failed, error code ", (int) bytes_read);
            return false;
        }
        if (!write_flash(address_offset, bytes_read, buffer))
        {
            logmsg("Failed to write flash at offset: ", address_offset, " bytes read: ",(int) bytes_read);
            return false;
        }
        
        // check the mainline firmware is valid
        if (address_offset == PLATFORM_BOOTLOADER_SIZE)
        {
            if (buffer[3] != 0x20 || buffer[7] != 0x08)
            {
                logmsg("Invalid firmware file, starts with: ", bytearray(buffer, 16));
                return false;
            }

        }

        if (bytes_read < PLATFORM_FLASH_WRITE_BUFFER_SIZE)
        {
            break;
        }
        address_offset += bytes_read;
        
    }
    LED_OFF();
    return true;
}

void platform_boot_to_main_firmware()
{
    uint32_t *mainprogram_start = (uint32_t*)(0x08000000 + PLATFORM_BOOTLOADER_SIZE);
    SCB->VTOR = (uint32_t)mainprogram_start;
  
    __asm__(
        "msr msp, %0\n\t"
        "bx %1" : : "r" (mainprogram_start[0]),
                    "r" (mainprogram_start[1]) : "memory");
}

/**************************************/
/* SCSI configuration based on DIPSW1 */
/**************************************/

void platform_config_hook(S2S_TargetCfg *config)
{
    // Enable Apple quirks by dip switch
    if (g_enable_apple_quirks)
    {
        if (config->quirks == S2S_CFG_QUIRKS_NONE)
        {
            config->quirks = S2S_CFG_QUIRKS_APPLE;
        }
    }
}

/**********************************************/
/* Mapping from data bytes to GPIO BOP values */
/**********************************************/

#define PARITY(n) ((1 ^ (n) ^ ((n)>>1) ^ ((n)>>2) ^ ((n)>>3) ^ ((n)>>4) ^ ((n)>>5) ^ ((n)>>6) ^ ((n)>>7)) & 1)
#define X(n) (\
    ((n & 0x01) ? (SCSI_OUT_DB0 << 16) : SCSI_OUT_DB0) | \
    ((n & 0x02) ? (SCSI_OUT_DB1 << 16) : SCSI_OUT_DB1) | \
    ((n & 0x04) ? (SCSI_OUT_DB2 << 16) : SCSI_OUT_DB2) | \
    ((n & 0x08) ? (SCSI_OUT_DB3 << 16) : SCSI_OUT_DB3) | \
    ((n & 0x10) ? (SCSI_OUT_DB4 << 16) : SCSI_OUT_DB4) | \
    ((n & 0x20) ? (SCSI_OUT_DB5 << 16) : SCSI_OUT_DB5) | \
    ((n & 0x40) ? (SCSI_OUT_DB6 << 16) : SCSI_OUT_DB6) | \
    ((n & 0x80) ? (SCSI_OUT_DB7 << 16) : SCSI_OUT_DB7) | \
    (PARITY(n)  ? (SCSI_OUT_DBP << 16) : SCSI_OUT_DBP) | \
    (SCSI_OUT_REQ) \
)
    
const uint32_t g_scsi_out_byte_to_bop[256] =
{
    X(0x00), X(0x01), X(0x02), X(0x03), X(0x04), X(0x05), X(0x06), X(0x07), X(0x08), X(0x09), X(0x0a), X(0x0b), X(0x0c), X(0x0d), X(0x0e), X(0x0f),
    X(0x10), X(0x11), X(0x12), X(0x13), X(0x14), X(0x15), X(0x16), X(0x17), X(0x18), X(0x19), X(0x1a), X(0x1b), X(0x1c), X(0x1d), X(0x1e), X(0x1f),
    X(0x20), X(0x21), X(0x22), X(0x23), X(0x24), X(0x25), X(0x26), X(0x27), X(0x28), X(0x29), X(0x2a), X(0x2b), X(0x2c), X(0x2d), X(0x2e), X(0x2f),
    X(0x30), X(0x31), X(0x32), X(0x33), X(0x34), X(0x35), X(0x36), X(0x37), X(0x38), X(0x39), X(0x3a), X(0x3b), X(0x3c), X(0x3d), X(0x3e), X(0x3f),
    X(0x40), X(0x41), X(0x42), X(0x43), X(0x44), X(0x45), X(0x46), X(0x47), X(0x48), X(0x49), X(0x4a), X(0x4b), X(0x4c), X(0x4d), X(0x4e), X(0x4f),
    X(0x50), X(0x51), X(0x52), X(0x53), X(0x54), X(0x55), X(0x56), X(0x57), X(0x58), X(0x59), X(0x5a), X(0x5b), X(0x5c), X(0x5d), X(0x5e), X(0x5f),
    X(0x60), X(0x61), X(0x62), X(0x63), X(0x64), X(0x65), X(0x66), X(0x67), X(0x68), X(0x69), X(0x6a), X(0x6b), X(0x6c), X(0x6d), X(0x6e), X(0x6f),
    X(0x70), X(0x71), X(0x72), X(0x73), X(0x74), X(0x75), X(0x76), X(0x77), X(0x78), X(0x79), X(0x7a), X(0x7b), X(0x7c), X(0x7d), X(0x7e), X(0x7f),
    X(0x80), X(0x81), X(0x82), X(0x83), X(0x84), X(0x85), X(0x86), X(0x87), X(0x88), X(0x89), X(0x8a), X(0x8b), X(0x8c), X(0x8d), X(0x8e), X(0x8f),
    X(0x90), X(0x91), X(0x92), X(0x93), X(0x94), X(0x95), X(0x96), X(0x97), X(0x98), X(0x99), X(0x9a), X(0x9b), X(0x9c), X(0x9d), X(0x9e), X(0x9f),
    X(0xa0), X(0xa1), X(0xa2), X(0xa3), X(0xa4), X(0xa5), X(0xa6), X(0xa7), X(0xa8), X(0xa9), X(0xaa), X(0xab), X(0xac), X(0xad), X(0xae), X(0xaf),
    X(0xb0), X(0xb1), X(0xb2), X(0xb3), X(0xb4), X(0xb5), X(0xb6), X(0xb7), X(0xb8), X(0xb9), X(0xba), X(0xbb), X(0xbc), X(0xbd), X(0xbe), X(0xbf),
    X(0xc0), X(0xc1), X(0xc2), X(0xc3), X(0xc4), X(0xc5), X(0xc6), X(0xc7), X(0xc8), X(0xc9), X(0xca), X(0xcb), X(0xcc), X(0xcd), X(0xce), X(0xcf),
    X(0xd0), X(0xd1), X(0xd2), X(0xd3), X(0xd4), X(0xd5), X(0xd6), X(0xd7), X(0xd8), X(0xd9), X(0xda), X(0xdb), X(0xdc), X(0xdd), X(0xde), X(0xdf),
    X(0xe0), X(0xe1), X(0xe2), X(0xe3), X(0xe4), X(0xe5), X(0xe6), X(0xe7), X(0xe8), X(0xe9), X(0xea), X(0xeb), X(0xec), X(0xed), X(0xee), X(0xef),
    X(0xf0), X(0xf1), X(0xf2), X(0xf3), X(0xf4), X(0xf5), X(0xf6), X(0xf7), X(0xf8), X(0xf9), X(0xfa), X(0xfb), X(0xfc), X(0xfd), X(0xfe), X(0xff)
};

#undef X